package com.motaqom.donbus;

public class Data {
    public static String[] data = {"[\n" +
            "{\n" +
            "id: \"28\",price: \"3р\",from: \"А/С \\\"Крытый рынок\\\"\",to: \"А/С \\\"Буденовская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"30\",price: \"3р\",from: \"Крытый рынок\",to: \"\\\"Химик\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"34\",price: \"3р\",from: \"г. Моспино\",to: \"А/С \\\"Буденовская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"41\",price: \"3р\",from: \"А/С \\\"Абакумова\\\"\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"42\",price: \"3р\",from: \"А/С \\\"Трудовские\\\"\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"73\",price: \"3р\",from: \"пр. Партизанский\",to: \"м/н Широкий\"\n" +
            "},\n" +
            "{\n" +
            "id: \"80\",price: \"3р\",from: \"А/С \\\"Центр\\\"\",to: \"п. Павлоградское\"\n" +
            "}\n" +
            "]\n",

            "[\n" +
            "{\n" +
            "id: R.drawable.dokuchaevsk, price: \"38р\",from: \"Донецк\",to: \"Докучаевск\"\n" +
            "}\n" +
            "]\n",

            "{\n" +
            "id: \"4\",price: \"11р\",from: \"А/С \\\"Центр\\\"\",to: \"пр. Мира\"\n" +
            "},\n" +
            "{\n" +
            "id: \"6\",price: \"10р\",from: \"Ж/Д вокзал»\",to: \"пр. Кремлевский\"\n" +
            "},\n" +
            "{\n" +
            "id: \"6А\",price: \"10р\",from: \"пр. Кремлевский\",to: \"Ж/Д вокзал\"\n" +
            "},\n" +
            "{\n" +
            "id: \"6Б\",price: \"10р\",from: \"Ж/Д вокзал\",to: \"Дом быта\"\n" +
            "},\n" +
            "{\n" +
            "id: \"7\",price: \"10р\",from: \"ул. Софийская\",to: \"Ж/Д Вокзал\"\n" +
            "},\n" +
            "{\n" +
            "id: \"8\",price: \"10р\", from: \"А/С \\\"Крытый рынок\\\"\",to: \"А/С \\\"Абакумова\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"10\",price: \"10р\",from: \"ул. Куйбышева\",to: \"пр. Партизанский\"\n" +
            "},\n" +
            "{\n" +
            "id: \"11\",price: \"10р\",from: \"А/С \\\"Центр\\\"\",to: \"м/н Восточный\"\n" +
            "},\n" +
            "{\n" +
            "id: \"13\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to: \"м/н  Донской\"\n" +
            "},\n" +
            "{\n" +
            "id: \"14\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to: \"ул. Щетинина\"\n" +
            "},\n" +
            "{\n" +
            "id: \"15\",price: \"10р\",from: \"А/С \\\"Буденовская\\\"\",to: \"Шахта №12\"\n" +
            "},\n" +
            "{\n" +
            "id: \"16\",price: \"10р\",from: \"Ж/Д вокзал\",to: \"А/С \\\"Крытый рынок\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"17\",price: \"10р\",from: \"ул. Ворохина\",to: \"ул. Туполева\"\n" +
            "},\n" +
            "{\n" +
            "id: \"18\",price: \"10р\",from: \"А/С \\\"Центр\\\"\",to: \"\\\"м/н Восточный\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"19\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"А/С \\\"Красногвардейская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"19А\",price: \"10р\",from: \"Ж/Д Вокзал\",to: \"А/С \\\"Красногвардейская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"20\",price: \"10р\",from: \"А/С \\\"Буденовская\\\"\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"20А\",price: \"10р\",from: \"СТО\" ,to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"20В\",price: \"10р\",from: \"А/С \\\"Центр\\\"\",to: \"А/С \\\"Буденовская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"21\",price: \"10р\",from: \"СТО\" ,to: №9\"\n" +
            "},\n" +
            "{\n" +
            "id: \"22\",price: \"10р\",from: \"\\\"Ж/Д вокзал\\\"\",to: \"пс. Лозовской\"\n" +
            "},\n" +
            "{\n" +
            "id: \"23\",price: \"10р\",from: \"ТЦ \\\"Амстор\\\"\",to: \"А/С \\\"Красногвардейская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"24\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"А/С Красно-ская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"24Б\",price: \"10р\",from: \"А/С \\\"Центр\\\"\",to: \"А/С \\\"Красногвардейская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"25\",price: \"10р\",from: \"м/н Широкий\",to: \"пр. Партизанский\"\n" +
            "},\n" +
            "{\n" +
            "id: \"26\",price: \"10р\",from: \"А/С \\\"Центр\\\"\",to: \"Ж/Д вокзал\"\n" +
            "},\n" +
            "{\n" +
            "id: \"27\",price: \"10р\",from: \"ул. Фабричная\",to: \"\\\"Большая Маги-ная\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"28\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"А/С \\\"Буденовская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"29\",price: \"10р\",from: \"СТО\" ,to: \"\\\"Ашан\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"32\",price: \"10р\",from: \"Ж/Д вокзал\",to: \"Мотель\"\n" +
            "},\n" +
            "{\n" +
            "id: \"33\",price: \"10р\",from: \"А/С \\\"Буденовская\\\"\",to: \"41-й км\"\n" +
            "},\n" +
            "{\n" +
            "id: \"34\",price: \"10р\",from: \"г. Моспино\",to: \"А/С \\\"Буденовская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"35А\",price: \"10р\",from: \"м/н Широкий\",to: \"Ж/Д вокзал\"\n" +
            "},\n" +
            "{\n" +
            "id: \"36\",price: \"10р\",from: \"Мотель\" ,to: \"\\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"37\",price: \"10р\",from: \"м/н Широкий\",to: \"Ж/Д вокзал\"\n" +
            "},\n" +
            "{\n" +
            "id: \"38\",price: \"10р\",from: \"ул. Савченко\",to: \"ЦУМ\"\n" +
            "},\n" +
            "{\n" +
            "id: \"38Б\",price: \"10р\",from: \"Ж/Д вокзал\",to: \"ул. Савченко\"\n" +
            "},\n" +
            "{\n" +
            "id: \"39\",price: \"10р\",from: \"ул. Харитонова\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"40А\",price: \"10р\",from: \"Шахта \\\"Челюскинцев\\\"\",to: \"ДП \\\"Пинтера\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"42А\",price: \"11р\",from: \"ГПНБ №1\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"42Г\",price: \"11р\",from: \"А/С \\\"Трудовские\\\"\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"43\",price: \"10р\",from: \"Совхоз \\\"Широкий\\\"\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"44\",price: \"10р\",from: \"ЗСК\" ,to: \"\\\"Центр\\\"\" \n" +
            "},\n" +
            "{\n" +
            "id: \"46\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"\\\"Большая Маги-ная\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"46Б\",price: \"10р\",from: \"Ж/Д вокзал\",to: \"ДС \\\"Большая Маги-ная\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"46В\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"Шахта №12\"\n" +
            "},\n" +
            "{\n" +
            "id: \"49\",price: \"10р\",from: \"А/С \\\"Центр\\\"\",to: \"Большая Маги-ная\"\n" +
            "},\n" +
            "{\n" +
            "id: \"50\",price: \"10р\",from: \"ул. Бучмы\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"53\",price: \"10р\",from: \"А/С \\\"Центр\\\"\",to: \"\\\"Большая Магистральная\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"54\",price: \"10р\",from: \"Ул. Бажовая\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"55\",price: \"10р\",from: \"А/С \\\"Буденовская\\\"\",to: \"\\\"Большая Маги-ная\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"58\",price: \"10р\",from: \"А/С \\\"Трудовская\\\"\",to: \"ДП \\\"Пинтера\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"59\",price: \"10р\",from: \"ДП \\\"Пинтера\\\"\",to: \"ул. Маяковского\"\n" +
            "},\n" +
            "{\n" +
            "id: \"60А\",price: \"10р\",from: \"А/С \\\"Трудовская\\\"\",to: \"Санстанция\"\n" +
            "},\n" +
            "{\n" +
            "id: \"61\",price: \"10р\",from: \"А/С \\\"Трудовская\\\"\",to: \"ст. Мандрыкино\"\n" +
            "},\n" +
            "{\n" +
            "id: \"63\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"А/В \\\"Западный\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"65\",price: \"10р\",from: \"А/С \\\"Абакумова\\\"\",to: \"ДП \\\"Пинтера\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"67\",price: \"10р\",from: \"ул. Нижнегородского\",to: \"А/С \\\"Буденовская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"69Б\",price: \"10р\",from: \"рынок \\\"Майский\\\"\",to: \"ул. Нижнегородского\"\n" +
            "},\n" +
            "{\n" +
            "id: \"70\",price: \"10р\",from: \"Ж/Д вокзал\",to: \"ул. Щетинина\"\n" +
            "},\n" +
            "{\n" +
            "id: \"74\",price: \"10р\",from: \"ул. Щетинина\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"75\",price: \"10р\",from: \"А/С \\\"Буденовская\\\"\",to: \"м/н Донской\"\n" +
            "},\n" +
            "{\n" +
            "id: \"76\",price: \"11р\",from: \"ул. Островского\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"77\",price: \"11р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"ДП \\\"Пинтера\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"78\",price: \"10р\",from: \"ул. Текстильщиков\",to: \"ДК шахты \\\"Лидиевка\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"79\",price: \"10р\",from: \"\\\"Сосна\\\"\" ,to: \"A/C \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"80\",price: \"10р\",from: \"с. Придорожное\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"80А\",price: \"10р\",from: \"Совхоз \\\"Тепличный\\\"\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"81\",price: \"10р\",from: \"А/С \\\"Буденовская\\\"\",to: \"п. Павлоградское\"\n" +
            "},\n" +
            "{\n" +
            "id: \"82\",price: \"10р\",from: \"ул. Щетинина\",to: \"Моспино\"\n" +
            "},\n" +
            "{\n" +
            "id: \"84\",price: \"10р\",from: \"\\\"Большая Магистральная\\\"\",to: \"\\\"Ашан\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"85\",price: \"11р\",from: \"ДП \\\"Пинтера\\\"\",to: \"А/С \\\"Центр\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"87\",price: \"10р\",from: \"ул. Островского\",to: \"м/н Широкий\"\n" +
            "},\n" +
            "{\n" +
            "id: \"93\",price: \"10р\",from: \"Шахта №7\",to: \"А/С \\\"Трудовская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"98\",price: \"10р\",from: \"ДП \\\"Пинтера\\\"\",to: \"Ж/Д вокзал\"\n" +
            "},\n" +
            "{\n" +
            "id: \"100\",price: \"10р\",from: \"ТЦ \\\"Амстор\\\"\",to: \"А/С \\\"Красногвардейская\\\"\"\n" +
            "}\n" +
            "]\n",

            "{\n" +
            "id: \"96\",price: \"11р\",from: \"ул. Щетинина\",to: \"Макеевка, А/С №1\"\n" +
            "},\n" +
            "{\n" +
            "id: \"107\",price: \"14р\",from: \"А/С \\\"Крытый рынок\\\"\",to:  \"А/С \\\"Плехановская\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"107Д\",price: \"16р\",from: \"А/С \\\"Крытый рынок\\\"\",to: \"Даки\"\n" +
            "},\n" +
            "{\n" +
            "id: \"111\",price: \"15р\",from: \"А/С \\\"Южный\\\"\",to: \"Макеевка, А/С №2\"\n" +
            "},\n" +
            "{\n" +
            "id: \"121\",price: \"10р\",from: \"А/С \\\"Крытый рынок\\\"\",to: \"Макеевка, А/С№1\"\n" +
            "}\n" +
            "]\n",

            "{\n" +
            "id: \"unknown\", from: \"Иловайск\", to: \"Ясиноватая-Пасс.\"\n" +
            "}\n" +
            "]\n",

            "{\n" +
            "id: \"1\",price: \"3р\",from: \"Ж/Д Вокзал\",to: \"ДМЗ\"\n" +
            "},\n" +
            "{\n" +
            "id: \"3\",price: \"3р\",from: \"Ул. Красноармейская\",to: \"\\\"ДонГорМаш\\\"\"\n" +
            "},\n" +
            "{\n" +
            "id: \"4\",price: \"3р\",from: \"Ул. Красноармейская\",to: \"Пр. Панфилова\"\n" +
            "},\n" +
            "{\n" +
            "id: \"5\",price: \"3р\",from: \"Ул. Красноармейская\",to: \"ул. Кирова\"\n" +
            "},\n" +
            "{\n" +
            "id: \"6\",price: \"3р\",from: \"Ул. Экономическая\",to: \"ДМЗ\"\n" +
            "},\n" +
            "{\n" +
            "id: \"8\",price: \"3р\",from: \"Ул. Красноармейская\",to: \"ул. Петровского\"\n" +
            "},\n" +
            "{\n" +
            "id: \"9\",price: \"3р\",from: \"ПКТИ\" ,to: Горького\"\n" +
            "},\n" +
            "{\n" +
            "id: \"10\",price: \"3р\",from: \"м/н Восточный\",to: \"ул. Горького\"\n" +
            "},\n" +
            "{\n" +
            "id: \"15\",price: \"3р\",from: \"Пл. Будённого\",to: \"Шахта №12\"\n" +
            "},\n" +
            "{\n" +
            "id: \"16\",price: \"3р\",from: \"пр. Кобзаря\",to: \"ул. Кирова\"\n" +
            "}\n" +
            "]\n",

            "{\n" +
            "id: \"2\",price: \"3р\",from: \"Ж/Д Вокзал\",to: \"ДМЗ\"\n" +
            "},\n" +
            "{\n" +
            "id: \"4\",price: \"3р\",from: \"пр. Мира\",to: \"ул. Горького\"\n" +
            "},\n" +
            "{\n" +
            "id: \"7\",price: \"3р\",from: \"Кинотеатр \\\"Космос\\\"\",to: \"ул. Горького\"\n" +
            "},\n" +
            "{\n" +
            "id: \"8\",price: \"3р\",from: \"Свято-Покровский храм\",to: \"ул. Университетская\"\n" +
            "},\n" +
            "{\n" +
            "id: \"10\",price: \"3р\",from: \"\\\"Винтер\\\"\" ,to: Партизанский\"\n" +
            "},\n" +
            "{\n" +
            "id: \"11\",price: \"3р\",from: \"м/н Восточный\",to: \"ул. Горького\"\n" +
            "},\n" +
            "{\n" +
            "id: \"12\",price: \"3р\",from: \"ул. Вышнеградского\",to: \"ул. Горького\"\n" +
            "},\n" +
            "{\n" +
            "id: \"14\",price: \"3р\",from: \"ул. Трудовых резервов\",to: \"УГУФМТ\"\n" +
            "},\n" +
            "{\n" +
            "id: \"17\",price: \"3р\",from: \"Пл. Свободы\",to: \"пр. Панфилова\"\n" +
            "},\n" +
            "{\n" +
            "id: \"21\",price: \"3р\",from: \"м/н Широкий\",to: \"ул. Пухова\"\n" +
            "}\n" +
            "]\n",

            "[\n" +
            "{\n" +
            "id: \"28\",start: \"3р\",end: \"ssssss\"\n" +
            "},\n" +
            "{\n" +
            "id: \"30\",start: \"31р\",end: \"ASS ddd\"\n" +
            "}\n" +
            "]\n",
            " "};

    public static String database = "https://motaqom.com/donbus/database/";
    public static String[] urls = {
            database + "buss.json",
            database + "trams.json",
            database + "trolleys.json",
            database + "routes.json",
            database + "suburbans.json",
            database + "intercitys.json",
            database + "trains.json",
            database + "bussTimetable.json",
            database + "stops.json"
    };
    public static String[] files = {
            "buss.txt",
            "trams.txt",
            "trolleys.txt",
            "routes.txt",
            "suburbans.txt",
            "intercitys.txt",
            "trains.txt",
            "bussTimetable.txt",
            "stops.txt"
    };
    public static String filePath = "/data/user/0/com.motaqom.donbus/files/";

    public static String bussTimetable = "[\n" +
            "{\n" +
            "id: \"28\",start: \"15:30\",end: \"15:40\n" +
            "},\n" +
            "{\n" +
            "id: \"230\",start: \"10:30\",end: \"19:26\n" +
            "}\n" +
            "]\n";
}
